result/reactive/throughput-latency.txt
# Warm-up: 8 threads, 10k connections, 2 minutes
wrk -t8 -c10000 -d120s --latency --timeout 10s http://10.152.0.2:8080/benchmark/delay/100 | tee performance.txt
sleep 15
# Pressure: 8 threads, 10k connections, 10 minutes, API dealy: 0.1 s, 0.2 s, 0.5 s
wrk -t8 -c10000 -d600s --latency --timeout 10s http://10.152.0.2:8080/benchmark/delay/100 | tee -a performance.txt
sleep 15
wrk -t8 -c10000 -d600s --latency --timeout 10s http://10.152.0.2:8080/benchmark/delay/200 | tee -a performance.txt
sleep 15
wrk -t8 -c10000 -d600s --latency --timeout 10s http://10.152.0.2:8080/benchmark/delay/500 | tee -a performance.txt
Running 2m test @ http://10.152.0.2:8080/benchmark/delay/100
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   321.14ms  787.12ms   9.99s    96.94%
    Req/Sec     6.01k     1.91k   12.57k    72.12%
  Latency Distribution
     50%  185.08ms
     75%  224.48ms
     90%  281.97ms
     99%    5.24s
  5670129 requests in 2.00m, 394.74MB read
  Socket errors: connect 0, read 719, write 0, timeout 2115
Requests/sec:  47219.35
Transfer/sec:      3.29MB
Running 10m test @ http://10.152.0.2:8080/benchmark/delay/100
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   203.18ms  175.15ms   8.32s    99.11%
    Req/Sec     6.37k     1.57k   12.01k    68.32%
  Latency Distribution
     50%  184.90ms
     75%  220.41ms
     90%  266.84ms
     99%  373.31ms
  30397503 requests in 10.00m, 2.07GB read
Requests/sec:  50656.86
Transfer/sec:      3.53MB
Running 10m test @ http://10.152.0.2:8080/benchmark/delay/200
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   222.52ms   24.44ms 563.58ms   85.26%
    Req/Sec     5.64k   846.79     9.30k    70.15%
  Latency Distribution
     50%  213.90ms
     75%  232.52ms
     90%  256.92ms
     99%  306.24ms
  26943375 requests in 10.00m, 1.83GB read
Requests/sec:  44901.52
Transfer/sec:      3.13MB
Running 10m test @ http://10.152.0.2:8080/benchmark/delay/500
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   500.67ms    4.22ms 743.65ms   99.06%
    Req/Sec     2.52k     1.17k    8.70k    68.99%
  Latency Distribution
     50%  500.29ms
     75%  500.48ms
     90%  501.01ms
     99%  504.71ms
  11966988 requests in 10.00m, 833.12MB read
Requests/sec:  19941.79
Transfer/sec:      1.39MB